{
  "https://www.thetvdb.com/series/gravity-falls" : {
    "premiere_date" : "2012-06-15",
    "title" : "Gravity Falls",
    "storyline" : "Twin brother and sister Dipper and Mabel Pines are in for an unexpected adventure when they spend the summer helping their Great Uncle Stan run a tourist trap in the mysterious town of Gravity Falls, Oregon.",
    "network" : "Disney XD"
  },
  "https://www.tvguide.com/tvshows/better-call-saul/590385/" : {
    "premiere_date" : "February 8, 2015",
    "title" : "Better Call Saul",
    "storyline" : "The evolution of \"Breaking Bad\" lawyer Saul Goodman is the focus of this prequel to the hit series.",
    "network" : ""
  },
  "https://www.themoviedb.org/tv/1421-modern-family?language=en-US" : {
    "premiere_date" : "2009",
    "title" : "Modern Family",
    "storyline" : "The Pritchett-Dunphy-Tucker clan is a wonderfully large and blended family. They give us an honest and often hilarious look into the sometimes warm, sometimes twisted, embrace of the modern family.",
    "network" : "ABC"
  },
  "https://www.metacritic.com/tv/weeds" : {
    "premiere_date" : "Aug 7, 2005",
    "title" : "Weeds",
    "storyline" : "This series is a single-camera comedy about a single mother who makes ends meet by selling marijuana in the fictional suburb of Agrestic, California. The series exposes the dirty little secrets that lie behind the pristine lawns and shiny closed doors of homes in the of this gated community.This series is a single-camera comedy about a single mother who makes ends meet by selling marijuana in the fictional suburb of Agrestic, California. The series exposes the dirty little secrets that lie behind the pristine lawns and shiny closed doors of homes in the of this gated community. Mary Louise Parker stars as the suburban mom who resorts to selling weed to support her family after her husband unexpectedly dies. Jenji Kohan executive produces and writes the series. Beginning with the premiere of the fourth season, the show shifted it's premise in almost it's entirety by relocating the cast to the fictional border town of Ren Mar after Agrestic burned to the ground. From here Nancy gave up her green thumb and began trafficking drugs over the border. Airing Information: First Season: Preview of pilot aired on Sunday, August 7, 2005 on Showtime at 10 PM EST with repeats on the following Monday, Wednesday, and Friday at 10PM EST. From then on episodes aired first on Mondays at 10PM EST with repeats on Mondays right after the episode premiere and on Wednesdays, and Fridays at 10:00PM EST and approximately 10:30PM EST and Sunday at 10:30PM EST. Second Season: The season premiere will air on Monday, August 14, 2006 on Showtime. Third Season: The season premiere will air on Monday, August 13, 2007 on Showtime at 10 PM EST. Production Information: Produced by Lions Gate Television in association with Titled Productions. Weeds has received a 10-episode commitment for it's first season. It was renewed after Weeds received a Golden Globe Nomination and the two leading ladies received nominations also. The 13 episodes of the second season were filmed. Theme Song: \"Little Boxes\" by Malvina Reynolds Awards and Nominations: 63rd Annual Golden Globes in 2006 1. Best Television Series - Musical or Comedy: Weeds (Showtime - Lions Gate Television, Inc.) Nomination 2. Best Performance by an Actress in a Television Series - Musical or Comedy: Mary-Louise Parker (Nancy Botwin) Won 3. Best Performance by an Actress in a Supporting Role in a Series, Mini-Series or Motion Picture Made for Television: Elizabeth Perkins (Celia Hodes) Nominated… Expand This series is a single-camera comedy about a single mother who makes ends meet by selling marijuana in the fictional suburb of Agrestic, California. The series exposes the dirty little secrets that lie behind the pristine lawns and shiny closed doors of homes in the of this gated community. This series is a single-camera comedy about a single mother who makes ends meet by selling marijuana in the fictional suburb of Agrestic, California. The series exposes the dirty little secrets that lie behind the pristine lawns and shiny closed doors of homes in the of this gated community. Mary Louise Parker stars as the suburban mom who resorts to selling weed to support her family after her husband unexpectedly dies. Jenji Kohan executive produces and writes the series. Beginning with the premiere of the fourth season, the show shifted it's premise in almost it's entirety by relocating the cast to the fictional border town of Ren Mar after Agrestic burned to the ground. From here Nancy gave up her green thumb and began trafficking drugs over the border. Airing Information: First Season: Preview of pilot aired on Sunday, August 7, 2005 on Showtime at 10 PM EST with repeats on the following Monday, Wednesday, and Friday at 10PM EST. From then on episodes aired first on Mondays at 10PM EST with repeats on Mondays right after the episode premiere and on Wednesdays, and Fridays at 10:00PM EST and approximately 10:30PM EST and Sunday at 10:30PM EST. Second Season: The season premiere will air on Monday, August 14, 2006 on Showtime. Third Season: The season premiere will air on Monday, August 13, 2007 on Showtime at 10 PM EST. Production Information: Produced by Lions Gate Television in association with Titled Productions. Weeds has received a 10-episode commitment for it's first season. It was renewed after Weeds received a Golden Globe Nomination and the two leading ladies received nominations also. The 13 episodes of the second season were filmed. Theme Song: \"Little Boxes\" by Malvina Reynolds Awards and Nominations: 63rd Annual Golden Globes in 2006 1. Best Television Series - Musical or Comedy: Weeds (Showtime - Lions Gate Television, Inc.) Nomination 2. Best Performance by an Actress in a Television Series - Musical or Comedy: Mary-Louise Parker (Nancy Botwin) Won 3. Best Performance by an Actress in a Supporting Role in a Series, Mini-Series or Motion Picture Made for Television: Elizabeth Perkins (Celia Hodes) Nominated …",
    "network" : "Showtime"
  },
  "https://www.imdb.com/title/tt1819545/?ref_=nv_sr_1" : {
    "premiere_date" : "2011",
    "title" : "I Hate My Teenage Daughter",
    "storyline" : "Nikki and Annie are two single mothers whose lives were made nightmarish by high school bullies. They raise their respective daughters with much more freedom than they did, but the daughters bite the hands that feed them and become the kind of girls who plagued their mothers during their teen years.",
    "network" : ""
  },
  "https://www.tvguide.com/tvshows/the-rain/1165673/" : {
    "premiere_date" : "May 4, 2018",
    "title" : "The Rain",
    "storyline" : "Survivors of an apocalyptic virus in Scandinavia try to put their lives back together six years after almost all humans were wiped out.",
    "network" : ""
  },
  "https://www.metacritic.com/tv/altered-carbon" : {
    "premiere_date" : "Feb 2, 2018",
    "title" : "Altered Carbon",
    "storyline" : "Set 300 years in the future where consciousness can be stored digitally, a soldier named Takeshi Kovacs (Will Yun Lee/Joel Kinnaman) awakens in a new body when he is freed from prison by Laurens Bancroft (James Purefoy), who wants him to find who killed his previous body in the sci-fi seriesSet 300 years in the future where consciousness can be stored digitally, a soldier named Takeshi Kovacs (Will Yun Lee/Joel Kinnaman) awakens in a new body when he is freed from prison by Laurens Bancroft (James Purefoy), who wants him to find who killed his previous body in the sci-fi series based on Richard K. Morgan's 2002 novel Carbon.… Expand Set 300 years in the future where consciousness can be stored digitally, a soldier named Takeshi Kovacs (Will Yun Lee/Joel Kinnaman) awakens in a new body when he is freed from prison by Laurens Bancroft (James Purefoy), who wants him to find who killed his previous body in the sci-fi series Set 300 years in the future where consciousness can be stored digitally, a soldier named Takeshi Kovacs (Will Yun Lee/Joel Kinnaman) awakens in a new body when he is freed from prison by Laurens Bancroft (James Purefoy), who wants him to find who killed his previous body in the sci-fi series based on Richard K. Morgan's 2002 novel Carbon. …",
    "network" : "Netflix"
  },
  "https://www.metacritic.com/tv/narcos-mexico" : {
    "premiere_date" : "Nov 16, 2018",
    "title" : "Narcos: Mexico",
    "storyline" : "The companion series to Narcos focuses on the rise of Guadalajara Cartel as Félix Gallardo (Diego Luna) takes charge while newly posted DEA agent Kiki Camarena (Michael Pena) begins uncovering information about Felix's plans.",
    "network" : "Netflix"
  },
  "https://www.rottentomatoes.com/tv/how_i_met_your_mother" : {
    "premiere_date" : "Sep 19, 2005",
    "title" : "How I Met Your Mother",
    "storyline" : "A man named Ted tells his kids how he met the love of his life, through flashbacks, years in the future. The bored kids sit on the couch and listen as dad regales them with tales of his pursuit of romance. The sitcom's secondary character, Ted's smarmy friend, Barney, is a real standout, often stealing the show.",
    "network" : "CBS"
  },
  "https://www.themoviedb.org/tv/1399-game-of-thrones?language=en-US" : {
    "premiere_date" : "2011",
    "title" : "Game of Thrones",
    "storyline" : "Seven noble families fight for control of the mythical land of Westeros. Friction between the houses leads to full-scale war. All while a very ancient evil awakens in the farthest north. Amidst the war, a neglected military order of misfits, the Night's Watch, is all that stands between the realms of men and icy horrors beyond.",
    "network" : "HBO"
  },
  "https://trakt.tv/shows/nikita" : {
    "premiere_date" : "2010-09-08",
    "title" : "Nikita",
    "storyline" : "When she was a deeply troubled teenager, Nikita was rescued from death row and given a second chance by a secret U.S. agency known only as Division. What they didn't tell her was that she was being trained as a spy and assassin. Having escaped Division, Nikita is seeking retribution and will stop at nothing to expose and destroy their covert operation.",
    "network" : "The CW"
  },
  "https://trakt.tv/shows/vikings" : {
    "premiere_date" : "2013-03-03",
    "title" : "Vikings",
    "storyline" : "Vikings follows the adventures of Ragnar Lothbrok the greatest hero of his age. The series tells the sagas of Ragnar's band of Viking brothers and his family, as he rises to become King of the Viking tribes. As well as being a fearless warrior, Ragnar embodies the Norse traditions of devotion to the gods, legend has it that he was a direct descendant of Odin, the god of war and warriors.",
    "network" : "History"
  },
  "https://www.rottentomatoes.com/tv/the_blacklist" : {
    "premiere_date" : "Sep 23, 2013",
    "title" : "The Blacklist",
    "storyline" : "For decades, ex-government agent Raymond \"Red\" Reddington has been one of the FBI's most wanted fugitives. Brokering shadowy deals for criminals across the globe, Red was known by many as \"The Concierge of Crime.\" Now, he's mysteriously surrendered to the FBI with an explosive offer: He will help catch a long-thought-dead terrorist, Ranko Zamani, under the condition that he speaks only to Elizabeth \"Liz\" Keen, an FBI profiler fresh out of Quantico. -- (C) NBC",
    "network" : "NBC"
  },
  "https://www.metacritic.com/tv/suits" : {
    "premiere_date" : "Jun 23, 2011",
    "title" : "Suits",
    "storyline" : "A corporate lawyer hires a genius college dropout as his newest associate.",
    "network" : "USA"
  },
  "https://www.rottentomatoes.com/tv/the_good_doctor/" : {
    "premiere_date" : "Sep 25, 2017",
    "title" : "The Good Doctor",
    "storyline" : "A talented young surgeon with Savant syndrome ruffles feathers while saving lives at a prestigious hospital's pediatric surgical unit.",
    "network" : "ABC"
  },
  "https://www.imdb.com/title/tt0475784/?ref_=nv_sr_1" : {
    "premiere_date" : "2 October 2016",
    "title" : "Westworld",
    "storyline" : "The sci-fi western series from Jonathan Nolan and Lisa Joy was inspired by the 1973 Michael Crichton film of the same name and is set at a Wild West theme park created by Dr. Robert Ford (Anthony Hopkins) with human-like androids where guests are encouraged to indulge their fantasies and desires.",
    "network" : ""
  },
  "https://www.imdb.com/title/tt1845307/?ref_=nv_sr_1" : {
    "premiere_date" : "19 September 2011",
    "title" : "2 Broke Girls",
    "storyline" : "Sassy, streetwise Max works two jobs just to get by, one of which is waiting tables during the night shift at the retro-hip Williamsburg Diner. Sophisticated Caroline is an uptown trust fund princess who's having a run of bad luck that forces her to reluctantly give waitressing a shot. At first, Max sees Caroline as yet another in a long line of inept servers she must cover for, but she's surprised to find that Caroline has as much substance as she does style. When Caroline discovers Max's knack for baking amazing cupcakes, she sees a lucrative future for them, but they first need to raise the start-up money.",
    "network" : ""
  },
  "https://www.rottentomatoes.com/tv/will_grace?" : {
    "premiere_date" : "Sep 21, 1998",
    "title" : "Will & Grace",
    "storyline" : "Snappy hit about a straight woman and a gay man who are best friends.",
    "network" : "NBC"
  },
  "http://www.tv.com/shows/law-order/" : {
    "premiere_date" : "",
    "title" : "Law & Order",
    "storyline" : "Law & Order, the longest running crime series and the second longest-running drama series in the history of American broadcast television, started its 18th season on NBC in the winter of 2008. The brainchild of creator Dick Wolf, Law & Order is the most successful brand in the history of primetime television; the winner of the 1997 Emmy Award for Outstanding Drama Series, it ties Cheers and M*A*S*H for the most consecutive best series nominations (eleven) and the longest-running drama series currently on American television. The series has also turned into one of entertainment's preeminent brands using a distinct ripped from the headlines format, and has spawned the successful spinoffs Law & Order: Special Victims Unit, Law & Order: Criminal Intent, Crime & Punishment, Law & Order: Trial by Jury and Law & Order: Los Angeles. Filmed entirely in and around New York City, this realistic yet fictional drama looks at crime and justice from a dual perspective. Law & Order has been renewed through 2009 and delivers some of the highest ratings on television, ranking fourth for any drama on any network among adults 18-49 for the past four full seasons. Season-to-date, the show remains a top-25 series among adults 18-49, a top-20 series in total viewers and one of the most upscale dramas on television. Law & Order was also television's #5 drama in overall total viewers for the 2003-04 season with an average of 15.9 million viewers. The acclaimed crime drama has chased away more than 20 competing dramas from the Wednesday (10-11 p.m. ET) hour since moving to that time period in 1992-1993. In 2006, after nearly fourteen years of airing at 10:00 PM, the series was moved to 9:00 PM to make room for the new NBC series Heist. After only two weeks, NBC opted to return the show to its 10:00 P.M. timeslot after the show fared poorly at 9:00 P.M.moreless",
    "network" : "NBC (ended 2010)"
  },
  "https://www.imdb.com/title/tt6315640/?ref_=nv_sr_1" : {
    "premiere_date" : "11 August 2017",
    "title" : "Atypical",
    "storyline" : "Atypical is a coming of age story that follows Sam, an 18-year-old on the autistic spectrum as he searches for love and independence. While Sam is on his funny yet emotional journey of self-discovery, the rest of his family must grapple with change in their own lives as they all struggle with the central theme: what does it really mean to be normal?",
    "network" : ""
  },
  "https://www.themoviedb.org/tv/1668-friends?language=en-US" : {
    "premiere_date" : "1994",
    "title" : "Friends",
    "storyline" : "The misadventures of a group of friends as they navigate the pitfalls of work, life and love in Manhattan.",
    "network" : "NBC"
  },
  "http://www.tv.com/shows/blackish/" : {
    "premiere_date" : "",
    "title" : "black-ish",
    "storyline" : "A father living in an upper-middle class neighborhood struggles to raise his children while ensuring they have a sense of cultural identity. Complicating his efforts is the fact that there are constant contradictions coming from his liberal wife, old-school father and his own color-blind kids.",
    "network" : "ABC"
  },
  "http://www.tv.com/shows/buffy-the-vampire-slayer/" : {
    "premiere_date" : "",
    "title" : "Buffy the Vampire Slayer",
    "storyline" : "In every generation there is a Chosen One. She alone will stand against the vampires, the demons and the forces of darkness. She is the Slayer. Sarah Michelle Gellar stars as Buffy Summers, The Chosen One, the one girl in all the world with the strength and skill to fight the vampires. With the help of her close friends, Willow (Alyson Hannigan), Xander (Nicholas Brendon), and her Watcher Giles (Anthony Stewart Head), she balances slaying, family, friendships, and relationships. For five years Buffy slayed vampires on the WB; then for her last two seasons she went to UPN. Theme music by Nerf Herder.",
    "network" : "The WB (ended 2003)"
  },
  "https://www.tvguide.com/tvshows/altered-carbon/1040368/" : {
    "premiere_date" : "February 2, 2018",
    "title" : "Altered Carbon",
    "storyline" : "Set in the 25th century, the human mind has been digitized with the ability to transfer a soul from one body to the next. Based on the award-winning sci-fi novel of the same title by Richard K. Morgan.",
    "network" : ""
  },
  "https://www.thetvdb.com/series/stranger-things" : {
    "premiere_date" : "2016-07-15",
    "title" : "Stranger Things",
    "storyline" : "When a young boy disappears, his mother, a police chief, and his friends must confront terrifying forces in order to get him back.",
    "network" : "Netflix"
  },
  "https://www.rottentomatoes.com/tv/skins_uk_" : {
    "premiere_date" : "",
    "title" : "Skins (UK)",
    "storyline" : "The raucous goings-on among a group of teens in Bristol are chronicled in this drama series.",
    "network" : "Channel 4"
  },
  "https://www.metacritic.com/tv/bojack-horseman" : {
    "premiere_date" : "Aug 22, 2014",
    "title" : "BoJack Horseman",
    "storyline" : "An animated comedy about the struggles of the former sitcom star (Will Arnett) who happens to be half-horse, half-man, while living in Los Angeles.",
    "network" : "Netflix"
  },
  "https://www.imdb.com/title/tt0903747/?ref_=nv_sr_1" : {
    "premiere_date" : "20 January 2008",
    "title" : "Breaking Bad",
    "storyline" : "When chemistry teacher Walter White is diagnosed with Stage III cancer and given only two years to live, he decides he has nothing to lose. He lives with his teenage son, who has cerebral palsy, and his wife, in New Mexico. Determined to ensure that his family will have a secure future, Walt embarks on a career of drugs and crime. He proves to be remarkably proficient in this new world as he begins manufacturing and selling methamphetamine with one of his former students. The series tracks the impacts of a fatal diagnosis on a regular, hard working man, and explores how a fatal diagnosis affects his morality and transforms him into a major player of the drug trade.",
    "network" : ""
  },
  "https://www.imdb.com/title/tt0496424/?ref_=nv_sr_2" : {
    "premiere_date" : "11 October 2006",
    "title" : "30 Rock",
    "storyline" : "Elizabeth \"Liz\" Lemon is the executive show runner for a late night sketch comedy show called \"The Girlie Show\", that stars her close friend and major drama queen Jenna Maroney. When GE hires a new executive vice president for NBC named Jack Donaghy, he decides to take Liz Lemon under his wing and turn around TGS, which for years has been unable to find the proper audience it deserves. So to do so, he brings on unhinged, wildly unpredictable star Tracy Jordan to turn the series into a ratings hit. But Liz soon finds out that controlling her odd ball writing staff, the NBC page program, keeping Tracy on a short leash, and getting him to get along with Jenna proves to be one disaster after another. Will TGS ever see true success? And will Liz find the right partner to get married and start a family?",
    "network" : ""
  },
  "https://www.thetvdb.com/series/modern-family" : {
    "premiere_date" : "2009-09-23",
    "title" : "Modern Family",
    "storyline" : "This mockumentary explores the many different types of a modern family through the stories of a gay couple, comprised of Mitchell and Cameron, and their daughter Lily, a straight couple, comprised of Phil and Claire, and their three kids, Haley, Alex, and Luke, and a multi-ethnic couple, which is comprised of Jay and Gloria, and her son Manny.",
    "network" : "ABC"
  },
  "https://trakt.tv/shows/friends" : {
    "premiere_date" : "1994-09-23",
    "title" : "Friends",
    "storyline" : "Rachel Green, Ross Geller, Monica Geller, Joey Tribbiani, Chandler Bing and Phoebe Buffay are all friends, living off of one another in the heart of New York City. Over the course of ten years, this average group of buddies goes through massive mayhem, family trouble, past and future romances, fights, laughs, tears and surprises as they learn what it really means to be a friend.",
    "network" : "NBC"
  },
  "https://www.imdb.com/title/tt1844624/?ref_=nv_sr_2" : {
    "premiere_date" : "5 October 2011",
    "title" : "American Horror Story",
    "storyline" : "Both physical and psychological horrors affect a decomposing family, workers and residents of an insane asylum, a coven of witches, a cast of circus freaks, the employees and guests at a struggling hotel, a family who moved into a mysterious farmhouse, and the members of a small suburb in Michigan in this haunting anthology series, focusing on the themes of infidelity, sanity, oppression, discrimination, addiction, and exploitation.",
    "network" : ""
  },
  "https://www.rottentomatoes.com/tv/the_o_c_" : {
    "premiere_date" : "Aug 5, 2003",
    "title" : "The O.C.",
    "storyline" : "A slick hit about a troubled L.A. teen taken in by an idealistic lawyer and his family in affluent Orange County. The series filled the youth-soap hole left by the departed '90210,' but quickly proved itself far more gritty---and witty. In addition, early plots set up an appealing balance between the kids and grown-ups, who were portrayed as real people with real problems, instead of sounding boards for the unblemished Romeos and Juliets. From the directors of 'Go' and 'Charlie's Angels.'",
    "network" : "FOX"
  },
  "https://www.tvguide.com/tvshows/skins/309170/" : {
    "premiere_date" : "January 17, 2011",
    "title" : "Skins",
    "storyline" : "Drama following a group of teens as they stumble through adolescence. Adapted from the popular British series.",
    "network" : ""
  },
  "https://www.themoviedb.org/tv/1402-the-walking-dead?language=en-US" : {
    "premiere_date" : "2010",
    "title" : "The Walking Dead",
    "storyline" : "Sheriff's deputy Rick Grimes awakens from a coma to find a post-apocalyptic world dominated by flesh-eating zombies. He sets out to find his family and encounters many other survivors along the way.",
    "network" : "AMC"
  },
  "https://www.imdb.com/title/tt6048596/?ref_=nv_sr_1" : {
    "premiere_date" : "2 August 2017",
    "title" : "The Sinner",
    "storyline" : "Follows the story of a young woman who commits a horrific act of violence and rage, and to her surprise, has no idea why. The investigator who becomes obsessed with the case is determined to dig into her past and figure out why this is happening.",
    "network" : ""
  },
  "https://www.rottentomatoes.com/tv/westworld" : {
    "premiere_date" : "Oct 2, 2016",
    "title" : "Westworld",
    "storyline" : "A sci-fi drama set in an Old West theme park where guests interact with automatons in scenarios that are developed, overseen and scripted by the park's creative, security and quality assurance departments. Based on the 1973 feature film directorial debut by Michael Crichton.",
    "network" : "HBO"
  },
  "https://www.rottentomatoes.com/tv/the_big_bang_theory" : {
    "premiere_date" : "Sep 24, 2007",
    "title" : "The Big Bang Theory",
    "storyline" : "A new comedy about a pair of brilliant physicists who understand how the universe works but have no clue about how to interact with people.",
    "network" : "CBS"
  },
  "https://trakt.tv/shows/westworld" : {
    "premiere_date" : "2016-10-03",
    "title" : "Westworld",
    "storyline" : "Westworld is a dark odyssey about the dawn of artificial consciousness and the evolution of sin. Set at the intersection of the near future and the reimagined past, it explores a world in which every human appetite, no matter how noble or depraved, can be indulged.",
    "network" : "HBO"
  },
  "https://www.imdb.com/title/tt7549864/" : {
    "premiere_date" : "16 November 2017",
    "title" : "The IMDb Show",
    "storyline" : "\"The IMDb Show\" is here to help you dive deeper into the shows and movies you love and discover new ones you won't be able to stop watching.",
    "network" : ""
  },
  "https://trakt.tv/shows/mr-robot" : {
    "premiere_date" : "2015-06-23",
    "title" : "Mr. Robot",
    "storyline" : "Mr. Robot follows Elliot, a young programmer who works as a cyber-security engineer by day and a vigilante hacker by night. Elliot finds himself at a crossroads when the mysterious leader of an underground hacker group recruits him to destroy the corporation he is paid to protect.",
    "network" : "USA Network"
  },
  "https://www.thetvdb.com/series/general-hospital" : {
    "premiere_date" : "1963-04-01",
    "title" : "General Hospital",
    "storyline" : "General Hospital, the Emmy Award-Winning drama series hailed by critics as the 'The Greatest Soap Opera of All Time', recently celebrated 40 years of broadcasting. The program inspired Port Charles, the spin-off series that premiered in June 1997, and ended October 2003. GH has had lots of movie and tv stars (and those in the making) over the years such as Demi Moore, Jack Wagner, Vanessa Marcil, Elizabeth Taylor, Ricky Martin, Rick Springfield, John Stamos, among others, as well as other soap opera stars.General Hospital is the longest-running dramatic serial on the ABC Network, and is the longest-running daytime drama produced on the West Coast. In May of 2000, General Hospital made Daytime Emmy history as the only Daytime drama to ever receive the prestigious Emmy Award for Outstanding Drama series a record seven times, marking the show's fifth win in six years (1995, 1996, 1997, 1999, and 2000). It had also garnered the Emmy Award as Outstanding Daytime Drama Series in 1980-8",
    "network" : "ABC"
  },
  "https://trakt.tv/shows/3-2016" : {
    "premiere_date" : "2016-11-25",
    "title" : "3%",
    "storyline" : "A thriller set in a world sharply divided between progress and devastation, where people are given the chance to make it to the \"better side\" but only 3% of the candidates succeed.",
    "network" : "Netflix"
  },
  "https://www.rottentomatoes.com/tv/bull/" : {
    "premiere_date" : "Sep 20, 2016",
    "title" : "Bull",
    "storyline" : "A renowned psychologist heads a prolific trial consulting service in this drama series based on the early career of Dr. Phil McGraw.",
    "network" : "CBS"
  },
  "https://www.metacritic.com/tv/breaking-bad" : {
    "premiere_date" : "Jan 20, 2008",
    "title" : "Breaking Bad",
    "storyline" : "A chemistry teacher decides to start a Meth lab.",
    "network" : "AMC"
  },
  "https://trakt.tv/shows/money-heist" : {
    "premiere_date" : "2017-05-02",
    "title" : "Money Heist",
    "storyline" : "A master stroke devised and perfected for years, planned for months and executed in a few minutes so that the chosen group of thieves who enters the National Mint and Timbre at gunpoint make the police believe that their plan has failed... And that they are besieged inside the building with no other exit than their surrender.",
    "network" : "Netflix"
  },
  "https://www.tvguide.com/tvshows/nikita/304040/" : {
    "premiere_date" : "September 9, 2010",
    "title" : "Nikita",
    "storyline" : "A spy emerges from hiding to seek revenge on a clandestine government agency that betrayed her after rescuing her as a teen and training her to be an assassin.",
    "network" : ""
  },
  "https://www.tvguide.com/tvshows/la-casa-de-papel/1155946/" : {
    "premiere_date" : "May 2, 2017",
    "title" : "La casa de papel",
    "storyline" : "An enigmatic character called The Professor plans something unique when he plots to carry out the biggest robbery in history.",
    "network" : ""
  },
  "https://www.thetvdb.com/series/supergirl" : {
    "premiere_date" : "2015-10-26",
    "title" : "Supergirl",
    "storyline" : "As Superman’s cousin, Kara Danvers (aka Supergirl) balances her work as a reporter for CatCo Worldwide Media with her work for the Department of Extra-Normal Operations (DEO), a super-secret government organization whose mission is to keep National City – and the Earth – safe from sinister threats..",
    "network" : "The CW"
  },
  "http://www.tv.com/shows/will-and-grace/" : {
    "premiere_date" : "",
    "title" : "Will & Grace",
    "storyline" : "Will & Grace is a hilarious series about two best friends. The twist is that Will is gay Grace is a straight interior designer. More than friends, but less than lovers, the two share a special bond and their personalities easily balance one another's. In addition to the stable Will and Grace, the show features Will's flamboyantly gay friend, Jack and Grace's sarcastic, spoiled, and boozy assistant, Karen. Will & Grace is the only series of such length (8 years) to have all of its episodes directed by the same director, in this case the talented James Burrows. Will & Grace is also one of the three series in which all of the main cast memebers won Emmy awards, with the other two shows being The Golden Girls, and All in the Family. Throughout its 8-year run, Will & Grace has been nominated for 83 Emmys, 24 Golden Globes, 14 SAG Awards and six People's Choice Awards. Among its 12 Emmy wins, the show won as Outstanding Comedy Series in 2000. In 2002, 2003, 2005, and 2006, it had more Emmy nominations than any other comedy series. Additionally, it's been nominated for an American Comedy Award, three GLAAD Media Awards and a Founders Award from the Viewers for Quality Television. NBC Broadcast History September 1998-November 1998 – Monday 9:30 December 1998-March 1999–Tuesday 9:30 April 1999-May 1999 – Thursday 8:30 September 1999-May 2000 – Tuesday 9:00 October 2000-January 2004 – Thursday 9:00 January 2004-April 2004 – Thursday 8:32 April 2004-September 2004 – Thursday 9:00 September 2004-December 2005 – Thursday 8:30 January 2006-May 2006 – Thursday 8:00moreless",
    "network" : "NBC"
  },
  "https://trakt.tv/shows/the-good-doctor" : {
    "premiere_date" : "2017-09-26",
    "title" : "The Good Doctor",
    "storyline" : "Shaun Murphy, a young surgeon with autism and savant syndrome, relocates from a quiet country life to join a prestigious hospital surgical unit. Alone in the world and unable to personally connect with those around him, Shaun uses his extraordinary medical gifts to save lives and challenge the skepticism of his colleagues.",
    "network" : "ABC"
  },
  "https://www.themoviedb.org/tv/1408-house?language=en-US" : {
    "premiere_date" : "2004",
    "title" : "House",
    "storyline" : "Dr. Gregory House, a drug-addicted, unconventional, misanthropic medical genius, leads a team of diagnosticians at the fictional Princeton–Plainsboro Teaching Hospital in New Jersey.",
    "network" : "FOX"
  },
  "https://www.themoviedb.org/tv/1425-house-of-cards?language=en-US" : {
    "premiere_date" : "2013",
    "title" : "House of Cards",
    "storyline" : "Set in present day Washington, D.C., House of Cards is the story of Frank Underwood, a ruthless and cunning politician, and his wife Claire who will stop at nothing to conquer everything. This wicked political drama penetrates the shadowy world of greed, sex and corruption in modern D.C. House of Cards is an adaptation of a previous BBC miniseries of the same name, which is based on the novel by Michael Dobbs.",
    "network" : "Netflix"
  },
  "https://www.tvguide.com/tvshows/new-girl/325438/" : {
    "premiere_date" : "September 20, 2011",
    "title" : "New Girl",
    "storyline" : "Sitcom centered on Jess Day, a sweet but naive twentysomething, who shares a loft with three guys.",
    "network" : ""
  },
  "https://trakt.tv/shows/brooklyn-nine-nine" : {
    "premiere_date" : "2013-09-17",
    "title" : "Brooklyn Nine-Nine",
    "storyline" : "A single-camera ensemble comedy following the lives of an eclectic group of detectives in a New York precinct, including one slacker who is forced to shape up when he gets a new boss.",
    "network" : "NBC"
  },
  "https://www.rottentomatoes.com/tv/vikings_2013" : {
    "premiere_date" : "Mar 3, 2013",
    "title" : "Vikings",
    "storyline" : "VIKINGS tells the tales of the raiding and trading of Norsemen in medieval Scandanavia.",
    "network" : "History"
  },
  "https://www.metacritic.com/tv/the-simpsons" : {
    "premiere_date" : "Dec 17, 1989",
    "title" : "The Simpsons",
    "storyline" : "Originally created by cartoonist Matt Groening, \"Our Favorite Family,\" has graced the small screen in one form or another for over 20 years. The Simpson family first appeared on television as the subjects of interstitial \"shorts\" on The Tracey Ullman Show in April of 1987. The SimpsonsOriginally created by cartoonist Matt Groening, \"Our Favorite Family,\" has graced the small screen in one form or another for over 20 years. The Simpson family first appeared on television as the subjects of interstitial \"shorts\" on The Tracey Ullman Show in April of 1987. The Simpsons remained a staple on The Tracey Ullman Show for three seasons until they premiered in their own half-hour series, on December 17, 1989. With the help of Jim Brooks and Sam Simon, Matt Groening's cartoon family turned into an instant success. Set in Springfield, the average American town, the show focuses on the antics and everyday adventures of the Simpson family; Homer, Marge, Bart, Lisa and Maggie, as well as a virtual cast of thousands. Since the beginning, the series has been a pop culture icon, attracting hundreds of celebrities to guest star. The show has also made name for itself in its fearless satirical take on politics, media and American life in general. Currently in its 21st season, The Simpsons has piled up over 440 episodes, over 20 Emmy Awards, a handful of music albums, countless endorsements and merchandise, and even made the jump to the silver screen in the summer of 2007 with The Simpsons Movie. And according to Matt Groening, \"There is no end in sight.\"… Expand Originally created by cartoonist Matt Groening, \"Our Favorite Family,\" has graced the small screen in one form or another for over 20 years. The Simpson family first appeared on television as the subjects of interstitial \"shorts\" on The Tracey Ullman Show in April of 1987. The Simpsons Originally created by cartoonist Matt Groening, \"Our Favorite Family,\" has graced the small screen in one form or another for over 20 years. The Simpson family first appeared on television as the subjects of interstitial \"shorts\" on The Tracey Ullman Show in April of 1987. The Simpsons remained a staple on The Tracey Ullman Show for three seasons until they premiered in their own half-hour series, on December 17, 1989. With the help of Jim Brooks and Sam Simon, Matt Groening's cartoon family turned into an instant success. Set in Springfield, the average American town, the show focuses on the antics and everyday adventures of the Simpson family; Homer, Marge, Bart, Lisa and Maggie, as well as a virtual cast of thousands. Since the beginning, the series has been a pop culture icon, attracting hundreds of celebrities to guest star. The show has also made name for itself in its fearless satirical take on politics, media and American life in general. Currently in its 21st season, The Simpsons has piled up over 440 episodes, over 20 Emmy Awards, a handful of music albums, countless endorsements and merchandise, and even made the jump to the silver screen in the summer of 2007 with The Simpsons Movie. And according to Matt Groening, \"There is no end in sight.\" …",
    "network" : "FOX"
  },
  "https://www.imdb.com/title/tt0098800/?ref_=nv_sr_1" : {
    "premiere_date" : "10 September 1990",
    "title" : "The Fresh Prince of Bel-Air",
    "storyline" : "When Will, an inner-city teenager from Philly is sent by his mother to live with his relatives (the Banks') in Bel-Air, everybody is in for a surprise. It is funny how influence can go both ways...",
    "network" : ""
  },
  "https://www.rottentomatoes.com/tv/grey_s_anatomy" : {
    "premiere_date" : "Mar 27, 2005",
    "title" : "Grey's Anatomy",
    "storyline" : "Doctors at a Seattle teaching hospital hone their bedside manners on and off the job in this medical drama.",
    "network" : "ABC"
  },
  "https://www.imdb.com/title/tt0460637/?ref_=nv_sr_1" : {
    "premiere_date" : "22 September 2005",
    "title" : "Everybody Hates Chris",
    "storyline" : "Motivated by his childhood experiences, Emmy Award-winner/actor/comedian Chris Rock narrates this very hilarious and touching story of a teenager growing up as the oldest of three children in Brooklyn, NY, in 1982. 1982 is the year that Chris (Tyler James Williams) turns 13. Filled with dreams of being a cool teenager, Chris moves with his family from the projects to the \"Bed-Stuy: Do or Die\" neighborhood. As the family's emergency adult while his parents are working, he's responsible for taking care of his younger brother Drew (Tequan Richmond), who's taller and more confident than Chris, and sister Tonya (Imani Hakim), who gets all the parents' attention. Chris' rough, cost-conscious father Julius (Terry Crews) works numerous jobs to properly support his family. Sassy mom Rochelle (Tichina Arnold) runs the household on a tight budget, is very strict, and works part-time in a small real estate office. With his mom determined to see him in a good school, though Drew and Tonya go to ...",
    "network" : ""
  },
  "http://www.tv.com/shows/greys-anatomy/" : {
    "premiere_date" : "",
    "title" : "Grey's Anatomy",
    "storyline" : "Grey's Anatomy is a medical drama about a group of surgeons working at Seattle Grace Hospital. The show centers around Meredith Grey (Ellen Pompeo) and her life as a resident at the hospital. In addition to her relationship with her neurosurgeon husband, Derek Shepherd (Patrick Dempsey), and best friend Cristina Yang (Sandra Oh), it also explores her relationships with her peers and the other doctors around her. Each episode dives into different medical cases and personal dramas of the doctors at Seattle Grace, with Dr. Owen Hunt (Kevin McKidd) at the helm of the surgical department as the new Chief of Surgery.",
    "network" : "ABC"
  },
  "https://www.rottentomatoes.com/tv/alcatraz_the_complete_series/s01" : {
    "premiere_date" : "Jan 16, 2012",
    "title" : "Alcatraz",
    "storyline" : "When San Francisco Detective Rebecca Madsen (Sarah Jones) is assigned to a grisly homicide case, a fingerprint leads her to a shocking suspect: an Alcatraz inmate who died over 30 years ago. Once the enigmatic, knows-everything-but-tells-nothing government agent Emerson Hauser (Sam Neill) tries to impede her investigation, Madsen turns to Alcatraz expert Dr. Diego \"Doc\" Soto (Jorge Garcia), to help her piece together the inexplicable sequence of events. By delving into Alcatraz history, government cover-ups and Rebecca's own heritage, the team will ultimately discover that this reappearance is only a small part of a much larger, more sinister present-day threat. For while he may be the first, it quickly becomes clear that this fugitive won't be the last to reappear from Alcatraz.",
    "network" : "FOX"
  },
  "https://www.tvguide.com/tvshows/house/100213/" : {
    "premiere_date" : "November 16, 2004",
    "title" : "House",
    "storyline" : "He has little patience for patients, but misanthropic Gregory House is a brilliant diagnostician who probes life-and-death medical mysteries while 'CSI'-style graphics follow each disease's progression. 'X-Men' director Bryan Singer is one of the executive producers.",
    "network" : ""
  },
  "https://www.metacritic.com/tv/gossip-girl" : {
    "premiere_date" : "Sep 19, 2007",
    "title" : "Gossip Girl",
    "storyline" : "The O.C. moves to New York City's Upper West Side with a dash of gossip in the guise of Kristen Bell.",
    "network" : "The CW"
  },
  "https://www.imdb.com/title/tt2628232/?ref_=nv_sr_1" : {
    "premiere_date" : "28 April 2014",
    "title" : "Penny Dreadful",
    "storyline" : "Explorer Sir Malcolm Murray, American gunslinger Ethan Chandler, scientist Victor Frankenstein, and medium Vanessa Ives unite to combat supernatural threats in Victorian London.",
    "network" : ""
  },
  "https://trakt.tv/shows/santa-clarita-diet" : {
    "premiere_date" : "2017-02-03",
    "title" : "Santa Clarita Diet",
    "storyline" : "Married couple Sheila and Joel are real estate agents in Santa Clarita, California. The couple's lives take a dark turn after Sheila goes through a dramatic change.",
    "network" : "Netflix"
  },
  "https://www.imdb.com/title/tt0460649/?ref_=nv_sr_1" : {
    "premiere_date" : "19 September 2005",
    "title" : "How I Met Your Mother",
    "storyline" : "Ted Mosby sits down with his kids, to tell them the story of how he met their mother. The story is told through memories of his friends Marshall, Lily, Robin, and Barney Stinson. All legendary 9 seasons lead up to the moment of Ted's final encounter with \"the one.\"",
    "network" : ""
  },
  "https://www.metacritic.com/tv/freaks-and-geeks" : {
    "premiere_date" : "Sep 25, 1999",
    "title" : "Freaks and Geeks",
    "storyline" : "The universal experience of teenagehood as lived by the regular old freaks and geeks in a Michigan high school, circa 1980, is the subject of this wistful comedy-drama executive-produced by Emmy-winner Judd Apatow and series creator Paul Feig. Revolving around the lives of freak and geekThe universal experience of teenagehood as lived by the regular old freaks and geeks in a Michigan high school, circa 1980, is the subject of this wistful comedy-drama executive-produced by Emmy-winner Judd Apatow and series creator Paul Feig. Revolving around the lives of freak and geek siblings Lindsay and Sam Weir (Linda Cardellini, John Daley), the show includes the everyday fears, humiliations and little triumphs of adolescents past, present and, no doubt, future,too. For sophomore Lindsay, life is getting difficult. Jolted by the death of her grandmother, she dons her dad's old Army jacket and fights the one-girl battle of McKinley High. The allure of being a champion \"mathlete\" is losing its appeal, and her goals of college and career feel somehow irrelevant. She's alienated. Luckily, though, she's not really alone. Drifting away from her studious friends, she finds herself increasingly drawn to others like her, the \"freaks\" who ' refuse to accept the status quo. Among them are Daniel (James Franco), a friendly but also a dangerous guy who seems to like Lindsay, as does his bud Nick (Jason Segel), who dreams of stardom as a rock-and-roll drummer a la Led Zeppelin's Jon Bonham. Then there's Ken (Seth Rogen), an acerbic rebel, and Kim (Busy Philipps), a tough girl who doesn't go easy on Lindsay. Meanwhile, Lindsay's freshman brother Sam navigates high school like a mouse in a maze. Threatened at every turn, and attracted to an unattainable cheerleader, Sam faces his own set of obstacles. But he has good friends. Sure, they're \"geeks,\" but so is Sam. There's Neal (Samm Levine), a wise-acre, sci-fi loving geek, and bespectacled Bill (Martin Starr), a classic looking nerd who's unfortunately not as brainy as he appears. On the homefront, Lindsay and Sam suffer through the good intentions of their overbearing mom (Becky Ann Baker) and their hardwired dad Joe Flaherty), who turns every teen issue into a matter of life and death. Unfortunately the show was canceled after only 12 episodes had aired, this was due to the poor ratings obtained. A fan-led campaign caused NBC to broadcast three more episodes in July 2000, but these would not be seen until September of that year when the cable channel Fox Family aired them in syndication.… Expand The universal experience of teenagehood as lived by the regular old freaks and geeks in a Michigan high school, circa 1980, is the subject of this wistful comedy-drama executive-produced by Emmy-winner Judd Apatow and series creator Paul Feig. Revolving around the lives of freak and geek The universal experience of teenagehood as lived by the regular old freaks and geeks in a Michigan high school, circa 1980, is the subject of this wistful comedy-drama executive-produced by Emmy-winner Judd Apatow and series creator Paul Feig. Revolving around the lives of freak and geek siblings Lindsay and Sam Weir (Linda Cardellini, John Daley), the show includes the everyday fears, humiliations and little triumphs of adolescents past, present and, no doubt, future,too. For sophomore Lindsay, life is getting difficult. Jolted by the death of her grandmother, she dons her dad's old Army jacket and fights the one-girl battle of McKinley High. The allure of being a champion \"mathlete\" is losing its appeal, and her goals of college and career feel somehow irrelevant. She's alienated. Luckily, though, she's not really alone. Drifting away from her studious friends, she finds herself increasingly drawn to others like her, the \"freaks\" who ' refuse to accept the status quo. Among them are Daniel (James Franco), a friendly but also a dangerous guy who seems to like Lindsay, as does his bud Nick (Jason Segel), who dreams of stardom as a rock-and-roll drummer a la Led Zeppelin's Jon Bonham. Then there's Ken (Seth Rogen), an acerbic rebel, and Kim (Busy Philipps), a tough girl who doesn't go easy on Lindsay. Meanwhile, Lindsay's freshman brother Sam navigates high school like a mouse in a maze. Threatened at every turn, and attracted to an unattainable cheerleader, Sam faces his own set of obstacles. But he has good friends. Sure, they're \"geeks,\" but so is Sam. There's Neal (Samm Levine), a wise-acre, sci-fi loving geek, and bespectacled Bill (Martin Starr), a classic looking nerd who's unfortunately not as brainy as he appears. On the homefront, Lindsay and Sam suffer through the good intentions of their overbearing mom (Becky Ann Baker) and their hardwired dad Joe Flaherty), who turns every teen issue into a matter of life and death. Unfortunately the show was canceled after only 12 episodes had aired, this was due to the poor ratings obtained. A fan-led campaign caused NBC to broadcast three more episodes in July 2000, but these would not be seen until September of that year when the cable channel Fox Family aired them in syndication. …",
    "network" : "NBC"
  },
  "https://www.metacritic.com/tv/westworld" : {
    "premiere_date" : "Oct 2, 2016",
    "title" : "Westworld",
    "storyline" : "The sci-fi western series from Jonathan Nolan and Lisa Joy was inspired by the 1973 Michael Crichton film of the same name and is set at a Wild West theme park created by Dr. Robert Ford (Anthony Hopkins) with human-like androids where guests are encouraged to indulge their fantasies and desires.",
    "network" : "HBO"
  },
  "https://trakt.tv/shows/arrow" : {
    "premiere_date" : "2012-10-10",
    "title" : "Arrow",
    "storyline" : "After a violent shipwreck, playboy billionaire Oliver Queen had disappeared and been presumed dead for five years before being discovered alive on a remote island in the Pacific. When he returns home to Starling City, his devoted mother Moira, the beloved sister Thea, and his best friend Tommy are going to welcome him home, but they have the feeling that Oliver has changed because of his terrible experience on the island. Meanwhile, Oliver hides the truth about the man he has become, he is desperate to repair the actions he took as the child he was. More particularly, he seeks reconciliation with his ex-girlfriend, Laurel Lance. During the day, Oliver plays the role of a rich, carefree and careless womanizer as he used to be - flanked by his devoted chauffeur / bodyguard, John Diggle - while carefully concealing the secret identity. However, Laurel's father, Detective Quentin Lance, is determined to stop the operation of the vigilante in his city. Meanwhile, Oliver's own mother, Moira Queen, knows much more about the deadly shipwreck than she has let on and is more cruel than she could ever imagine.",
    "network" : "The CW"
  },
  "https://www.imdb.com/title/tt0944947/?ref_=nv_sr_1" : {
    "premiere_date" : "17 April 2011",
    "title" : "Game of Thrones",
    "storyline" : "In the mythical continent of Westeros, several powerful families fight for control of the Seven Kingdoms. As conflict erupts in the kingdoms of men, an ancient enemy rises once again to threaten them all. Meanwhile, the last heirs of a recently usurped dynasty plot to take back their homeland from across the Narrow Sea.",
    "network" : ""
  },
  "https://www.tvguide.com/tvshows/arrow/375406/" : {
    "premiere_date" : "October 10, 2012",
    "title" : "Arrow",
    "storyline" : "A billionaire playboy and expert archer becomes a vigilante who is out to right the wrongs created by his family and restore his beloved city back to its former glory after being shipwrecked for five years on a remote island.",
    "network" : ""
  },
  "http://www.tv.com/shows/the-simpsons/" : {
    "premiere_date" : "",
    "title" : "The Simpsons",
    "storyline" : "This is the 25th Treehouse of Horror in the Simpsons organized by Matt Groening. It is divided in three parts. Fox also said that one of the main characters will die in season 25. Bart loses his head and then finds it attached to Lisa's. Together they go to second grade and at night Bart finds out that when Lisa sleeps he is in control of her body. The Simpsons kids are sick and can't have candy or go trick or treating, but then comes the Fat in the hat (who is basically Homer) and takes them to the streets. Later Bart, Lisa, and Maggie try to escape because Fat in the Hat wants them to stay with him forever. A parody of cat in the hat of Dr. Seuss' rhyme books. At the long time ago circus Strongman Homer wants to take the devil creator's (Moe's) emerald, so he makes Marge marry him to later kill him, but Marge doesn't want to kill Moe, so she dumps Strongman. Meanwhile, a group of circus clowns and monsters kill Mr.Burns and take over the circus. moreless",
    "network" : "FOX"
  },
  "https://www.imdb.com/title/tt3061046/?ref_=nv_sr_2" : {
    "premiere_date" : "27 July 2013",
    "title" : "Steven Universe",
    "storyline" : "This series is set in the fictional Beach City, where ageless alien warriors, the Crystal Gems, live in an ancient beachside temple, protecting the world from evil. They project female humanoid forms from magical gemstones that are the core of their being. The Crystal Gems are Garnet, Amethyst, Pearl and Steven, a young half-human, half-Gem boy who inherited his gemstone from his mother, the Gems' former leader Rose Quartz. As Steven tries to figure out his powers, he spends his days with his human father Greg, his friend Connie, other people in Beach City, or the other Gems, whether to help them save the world or just to hang out. He explores the abilities passed down to him by his mother, which include fusion (the ability of Gems to merge their identities and bodies to form a new and more powerful personality).",
    "network" : ""
  },
  "https://www.thetvdb.com/series/lost" : {
    "premiere_date" : "2004-09-22",
    "title" : "Lost",
    "storyline" : "After their plane, Oceanic Air flight 815, tore apart whilst thousands of miles off course, the survivors find themselves on a mysterious deserted island where they soon find out they are not alone.",
    "network" : "ABC"
  },
  "https://www.thetvdb.com/series/izombie" : {
    "premiere_date" : "2015-03-17",
    "title" : "iZombie",
    "storyline" : "When over-achieving medical resident Liv Moore attends a party that turns into a zombie feeding frenzy, she ends up joining the ranks of the living dead. Determined to pass as human despite her pale appearance and newly listless demeanor, Liv forms a plan to resist her drive to consume fresh human brains by taking a job at a coroner's office, where she can secretly snack on the brains of corpses delivered there. Soon discovering that she absorbs the memories of those she feeds on, she finds new purpose by posing as a psychic and working with a detective to help solve their murders.",
    "network" : "The CW"
  },
  "https://www.metacritic.com/tv/house-of-cards-2013" : {
    "premiere_date" : "Feb 1, 2013",
    "title" : "House of Cards (2013)",
    "storyline" : "The US remake of the 1990s British political miniseries moves the shenanigans to Washington DC. After learning he won't be appointed to a coveted Cabinet position, House Majority Whip Francis Underwood (Kevin Spacey) and his wife Claire plan revenge on the administration he helped elect.",
    "network" : "Netflix"
  },
  "https://www.metacritic.com/tv/stranger-things" : {
    "premiere_date" : "Jul 15, 2016",
    "title" : "Stranger Things",
    "storyline" : "Set in Indiana, a young boy named Will (Noah Schnapp) disappears into thin air in 1983 and the search for him that includes Will's best friend Mike (Finn Wolfhard), leads to top secret experiments and a strange little girl (Millie Brown) in the woods.",
    "network" : "Netflix"
  },
  "https://www.rottentomatoes.com/tv/once_upon_a_time" : {
    "premiere_date" : "Oct 23, 2011",
    "title" : "Once Upon a Time",
    "storyline" : "A woman's destiny unfolds when she arrives in a modern-day town populated by fairy-tale characters.",
    "network" : "ABC"
  },
  "https://trakt.tv/shows/game-of-thrones" : {
    "premiere_date" : "2011-04-18",
    "title" : "Game of Thrones",
    "storyline" : "Seven noble families fight for control of the mythical land of Westeros. Friction between the houses leads to full-scale war. All while a very ancient evil awakens in the farthest north. Amidst the war, a neglected military order of misfits, the Night's Watch, is all that stands between the realms of men and the icy horrors beyond.",
    "network" : "HBO"
  },
  "https://www.themoviedb.org/tv/69050-riverdale?language=en-US" : {
    "premiere_date" : "2017",
    "title" : "Riverdale",
    "storyline" : "Set in the present, the series offers a bold, subversive take on Archie, Betty, Veronica and their friends, exploring the surreality of small-town life, the darkness and weirdness bubbling beneath Riverdale’s wholesome facade.",
    "network" : "The CW"
  },
  "https://www.imdb.com/title/tt5834204/?ref_=nv_sr_1" : {
    "premiere_date" : "26 April 2017",
    "title" : "The Handmaid's Tale",
    "storyline" : "A religion-based autocracy has taken over most of the United States, renaming the country Gilead. In this country women are second-class citizens. Anyone trying to escape is punished. One such person is June, who is captured while trying to escape with her husband and child and is sentenced to be a handmaid, bearing children for childless government officials. As a handmaid, June is renamed Offred. This is her story.",
    "network" : ""
  },
  "https://www.tvguide.com/tvshows/desperate-housewives/100118/" : {
    "premiere_date" : "October 3, 2004",
    "title" : "Desperate Housewives",
    "storyline" : "Following her suicide, Mary Alice Young keeps tabs on friends and family she left behind on bucolic suburban Wisteria Lane. But this being a prime-time soap (if a tongue-in-cheek one), they all harbor a sordid secret or two. Created by writer-producer Marc Cherry (a 'Golden Girls' alum), 'Housewives' was an instant hit and a frequent contender on Emmy night .",
    "network" : ""
  },
  "https://www.rottentomatoes.com/tv/the_oa" : {
    "premiere_date" : "Dec 16, 2016",
    "title" : "The OA",
    "storyline" : "Seven years after vanishing from her home, a young woman returns with mysterious new abilities and recruits five strangers for a secret mission.",
    "network" : "Netflix"
  },
  "https://www.imdb.com/title/tt5707802/?ref_=nv_sr_1" : {
    "premiere_date" : "28 April 2017",
    "title" : "Dear White People",
    "storyline" : "At a predominantly white Ivy League college, a diverse group of students navigate various forms of racial and other types of discrimination.",
    "network" : ""
  },
  "https://www.tvguide.com/tvshows/the-flash/644014/" : {
    "premiere_date" : "October 7, 2014",
    "title" : "The Flash",
    "storyline" : "Scientist Barry Allen acquires super speed through a freak accident and becomes known as the Fastest Man Alive in this adaptation of the DC Comics character the Flash.",
    "network" : ""
  },
  "https://www.rottentomatoes.com/tv/pretty_little_liars" : {
    "premiere_date" : "",
    "title" : "Pretty Little Liars",
    "storyline" : "Four estranged best friends are reunited one year after the queen bee of the group, Alison, goes missing. When they begin to receive disturbing messages from someone named \"A\", how far will they go to bury their secrets? ABC Family's Pretty Little Liars is a relationship drama filled with fun, mystery, intrigue, and secrets. Don't miss even one episode of this exciting new series!",
    "network" : "Freeform"
  },
  "https://www.imdb.com/title/tt0229889/?ref_=nv_sr_2" : {
    "premiere_date" : "21 June 1972",
    "title" : "Chaves",
    "storyline" : "The misadventures of a poor, homeless and fumbling boy and his friends in the humble neighborhood they live in.",
    "network" : ""
  },
  "https://www.rottentomatoes.com/tv/the_big_bang_theory/" : {
    "premiere_date" : "Sep 24, 2007",
    "title" : "The Big Bang Theory",
    "storyline" : "A new comedy about a pair of brilliant physicists who understand how the universe works but have no clue about how to interact with people.",
    "network" : "CBS"
  },
  "http://www.tv.com/shows/doctor-who-2005/" : {
    "premiere_date" : "",
    "title" : "Doctor Who",
    "storyline" : "\"I'm the Doctor, run for your life!\" A UK television staple, Doctor Who was revamped for the 21st century by the BBC, bringing the show back in 2005 after its cancellation in 1989. The Ninth Doctor (Christopher Eccleston) came and conquered but died saving the universe and his companions from the cursed Daleks. Regenerating for the ninth time, the Tenth Doctor (David Tennant) brought more secrets and dark sides of this universe. Past, Present, Future and beyond! After regenerating to once again save the life of a trusted companion, the Doctor (Matt Smith) is now on his eleventh incarnation. With new friends Amy Pond (Karen Gillian) and Rory Williams (Arthur Darvill), a newly revamped TARDIS inside and out, the Doctor is ready for more adventures in time and space. The Eleventh Doctor (Matt Smith) regenerated to become the Twelfth Doctor (Peter Capaldi).",
    "network" : "BBC America"
  },
  "https://www.rottentomatoes.com/tv/the_voice/" : {
    "premiere_date" : "",
    "title" : "The Voice",
    "storyline" : "Singers square off for a coveted recording contract in this reality talent contest from the producers of \"Big Brother\" and \"Survivor.\" Four vocal coaches mentor the contestants in three distinct competition phases: the blind auditions (during which the coaches can't see a contestant and thereby judge them solely on their vocal talent); the battle phase (in which the contestants are advised and developed); and, lastly, the live-performance phase.",
    "network" : "NBC"
  },
  "https://www.tvguide.com/tvshows/everybody-hates-chris/192250/" : {
    "premiere_date" : "September 24, 2006",
    "title" : "Everybody Hates Chris",
    "storyline" : "A black teen in Brooklyn during the early 1980s attends a mostly white school in a sitcom 'inspired by the childhood experiences' of comedian Chris Rock, who produced and narrates the series. Bolstered by a soundtrack that beautifully evokes the '80s, the show chronicles the life of the young Chris, whose family's penny-pinching is leavened by love (and laughs). At home, Chris helps care for his younger brother and sister, while at school he's often the target of a racist bully.",
    "network" : ""
  },
  "https://www.themoviedb.org/tv/63174-lucifer?language=en-US" : {
    "premiere_date" : "2016",
    "title" : "Lucifer",
    "storyline" : "Bored and unhappy as the Lord of Hell, Lucifer Morningstar abandoned his throne and retired to Los Angeles, where he has teamed up with LAPD detective Chloe Decker to take down criminals. But the longer he's away from the underworld, the greater the threat that the worst of humanity could escape.",
    "network" : "FOX"
  },
  "https://www.rottentomatoes.com/tv/how_to_get_away_with_murder" : {
    "premiere_date" : "Sep 25, 2014",
    "title" : "How to Get Away With Murder",
    "storyline" : "A law professor and a group of her best students are drawn into a real-life murder conspiracy.",
    "network" : "ABC"
  },
  "https://www.rottentomatoes.com/tv/better_call_saul/" : {
    "premiere_date" : "Feb 8, 2015",
    "title" : "Better Call Saul",
    "storyline" : "The evolution of \"Breaking Bad\" lawyer Saul Goodman is the focus of this prequel to the hit series.",
    "network" : "AMC"
  },
  "https://www.metacritic.com/tv/anne-with-an-e" : {
    "premiere_date" : "May 12, 2017",
    "title" : "Anne with an E",
    "storyline" : "The Moira Walley-Beckett adaptation of L.M. Montgomery's Anne of Green Gables where 13-year-old Anne (Amybeth McNulty) is sent to live with Marilla (Geraldine James) and Matthew Cuthbert (R.H. Thomson).",
    "network" : "Netflix"
  },
  "https://www.themoviedb.org/tv/46786-bates-motel?language=en-US" : {
    "premiere_date" : "2013",
    "title" : "Bates Motel",
    "storyline" : "A \"contemporary prequel\" to the 1960 film Psycho, depicting the life of Norman Bates and his mother Norma prior to the events portrayed in Hitchcock's film, albeit in a different fictional town and in a modern setting. The series begins after the death of Norma's husband, when she purchases a motel located in a coastal Oregon town so she and Norman can start a new life.",
    "network" : "A&E"
  },
  "https://www.imdb.com/title/tt0898266/?ref_=nv_sr_1" : {
    "premiere_date" : "1 May 2006",
    "title" : "The Big Bang Theory",
    "storyline" : "Leonard Hofstadter and Sheldon Cooper are both brilliant physicists working at Cal Tech in Pasadena, California. They are colleagues, best friends, and roommates, although in all capacities their relationship is always tested primarily by Sheldon's regimented, deeply eccentric, and non-conventional ways. They are also friends with their Cal Tech colleagues mechanical engineer Howard Wolowitz and astrophysicist Rajesh Koothrappali. The foursome spend their time working on their individual work projects, playing video games, watching science-fiction movies, or reading comic books. As they are self-professed nerds, all have little or no luck with women. When Penny, a pretty woman and an aspiring actress from Omaha, moves into the apartment across the hall from Leonard and Sheldon's, Leonard has another aspiration in life, namely to get Penny to be his girlfriend.",
    "network" : ""
  },
  "https://www.metacritic.com/tv/orphan-black" : {
    "premiere_date" : "Mar 30, 2013",
    "title" : "Orphan Black",
    "storyline" : "Sarah (Tatiana Maslany), a British orphan now living in America, witnesses the suicide of a woman named Beth, who looks exactly like her. Assuming Beth's identity brings Sarah a new apartment, a nice boyfriend, and trouble that includes a deadly conspiracy.",
    "network" : "BBC America"
  },
  "https://www.metacritic.com/tv/the-following" : {
    "premiere_date" : "Jan 21, 2013",
    "title" : "The Following",
    "storyline" : "Retired FBI agent Ryan Hardy (Kevin Bacon) is pulled back into service to find escaped serial killer Joe Carroll (James Purefoy).",
    "network" : "FOX"
  },
  "https://www.metacritic.com/tv/gilmore-girls" : {
    "premiere_date" : "Oct 5, 2000",
    "title" : "Gilmore Girls",
    "storyline" : "Set in a storybook Connecticut town populated with an eclectic mix of everyday folks and lovable lunatics, Gilmore Girls is a humorous multigenerational series about friendship, family and the ties that bind. Thirtysomething Lorelai Gilmore (Lauren Graham) has made her share of mistakes inSet in a storybook Connecticut town populated with an eclectic mix of everyday folks and lovable lunatics, Gilmore Girls is a humorous multigenerational series about friendship, family and the ties that bind. Thirtysomething Lorelai Gilmore (Lauren Graham) has made her share of mistakes in life, but she has been doing her best to see that her college-bound daughter - and best friend in the world - Rory (Alexis Bledel), doesn't follow in her footsteps. That may be easier said than done, considering that the two share the same interests, the same intellect, the same coffee addiction and the same eyes. Rory is more serious than Lorelai, but there are tendencies, especially in the love department, that clearly indicate she is her mother's daughter. From the beginning, this unique mother-daughter team has been growing up together. Lorelai was just Rory's age when she became pregnant and made the tough decision to raise her baby alone. Gilmore Girls was the first series to make it to air supported by the Family Friendly Forum's script development fund. An initiative between some of the nation's top advertisers and The WB, the program is intended to offer a greater array of compelling family programming on network television. The strong and loving mother-daughter relationship portrayed in Gilmore Girls reflects the growing reality of this new type of American family. … Expand Set in a storybook Connecticut town populated with an eclectic mix of everyday folks and lovable lunatics, Gilmore Girls is a humorous multigenerational series about friendship, family and the ties that bind. Thirtysomething Lorelai Gilmore (Lauren Graham) has made her share of mistakes in Set in a storybook Connecticut town populated with an eclectic mix of everyday folks and lovable lunatics, Gilmore Girls is a humorous multigenerational series about friendship, family and the ties that bind. Thirtysomething Lorelai Gilmore (Lauren Graham) has made her share of mistakes in life, but she has been doing her best to see that her college-bound daughter - and best friend in the world - Rory (Alexis Bledel), doesn't follow in her footsteps. That may be easier said than done, considering that the two share the same interests, the same intellect, the same coffee addiction and the same eyes. Rory is more serious than Lorelai, but there are tendencies, especially in the love department, that clearly indicate she is her mother's daughter. From the beginning, this unique mother-daughter team has been growing up together. Lorelai was just Rory's age when she became pregnant and made the tough decision to raise her baby alone. Gilmore Girls was the first series to make it to air supported by the Family Friendly Forum's script development fund. An initiative between some of the nation's top advertisers and The WB, the program is intended to offer a greater array of compelling family programming on network television. The strong and loving mother-daughter relationship portrayed in Gilmore Girls reflects the growing reality of this new type of American family. …",
    "network" : "WB The WB Netflix"
  },
  "https://www.tvguide.com/tvshows/gotham/638885/" : {
    "premiere_date" : "September 22, 2014",
    "title" : "Gotham",
    "storyline" : "An action-drama series following rookie detective James Gordon as he battles villains and corruption in pre-Batman Gotham City.",
    "network" : ""
  },
  "https://www.themoviedb.org/tv/19885-sherlock?language=en-US" : {
    "premiere_date" : "2010",
    "title" : "Sherlock",
    "storyline" : "A modern update finds the famous sleuth and his doctor partner solving crime in 21st century London.",
    "network" : "BBC One"
  },
  "https://www.thetvdb.com/series/game-of-thrones" : {
    "premiere_date" : "2011-04-17",
    "title" : "Game of Thrones",
    "storyline" : "Seven noble families fight for control of the mythical land of Westeros. Friction between the houses leads to full-scale war. All while a very ancient evil awakens in the farthest north. Amidst the war, a neglected military order of misfits, the Night's Watch, is all that stands between the realms of men and the icy horrors beyond.",
    "network" : "HBO"
  },
  "https://www.imdb.com/title/tt2649356/?ref_=nv_sr_1" : {
    "premiere_date" : "8 July 2018",
    "title" : "Sharp Objects",
    "storyline" : "Fresh from a brief stay at a psych hospital, reporter Camille Preaker faces a troubling assignment: she must return to her tiny hometown to cover the murders of two preteen girls. For years, Camille has hardly spoken to her neurotic, hypochondriac mother or to the half-sister she barely knows: a beautiful 13 year old with an eerie grip on the town. Now, installed in her old bedroom in her family's Victorian mansion, Camille finds herself identifying with the young victms - a bit too strongly. Dogged by her own demons, she must unravel the psychological puzzle of her own past if she wants to get the story - and survive this homecoming.",
    "network" : ""
  },
  "https://www.themoviedb.org/tv/63247-westworld?language=en-US" : {
    "premiere_date" : "2016",
    "title" : "Westworld",
    "storyline" : "A dark odyssey about the dawn of artificial consciousness and the evolution of sin. Set at the intersection of the near future and the reimagined past, it explores a world in which every human appetite, no matter how noble or depraved, can be indulged.",
    "network" : "HBO"
  },
  "https://www.rottentomatoes.com/tv/young_sheldon/" : {
    "premiere_date" : "Sep 25, 2017",
    "title" : "Young Sheldon",
    "storyline" : "Spin-off of \"The Big Bang Theory\" follows 9-year-old Sheldon Cooper as he grows up in East Texas and attends high school.",
    "network" : "CBS"
  },
  "http://www.tv.com/shows/the-big-bang-theory/" : {
    "premiere_date" : "",
    "title" : "The Big Bang Theory",
    "storyline" : "Created by writer/producers Chuck Lorre (of Two and a Half Men) and Bill Prady (of Gilmore Girls) comes The Big Bang Theory, a sitcom that shows what happens when hyper-intelligent roommates/physicists Sheldon and Leonard meet Penny, a beautiful woman moving in next door--and realize they know next to nothing about life outside of the lab. Rounding out the crew are Howard Wolowitz, who thinks he's as sexy as he is brainy, and Rajesh (Raj) Koothrappali, who suffers from an inability to speak in the presence of a woman. The show distinguishes itself by being unafraid to toss scientific references and technobabble into an otherwise standard sitcom, even employing a physicist to keep things accurate. In doing so, it allows Sheldon and Leonard to do for science what Frasier's Crane brothers did for fine dining, art, and opera. Theme Song: \"The History of Everything\" by Barenaked Ladies. The series won 10 Emmy Awards for Outstanding Lead Actor in a Comedy Series - Jim Parsons, Outstanding Lead Actor in a Comedy Series - Jim Parsons, Outstanding Technical Direction, Camerawork, Video Control for a Series - The Higgs Boson Observation, Outstanding Guest Actor in a Comedy Series - Bob Newhart: The Proton Resurgence, Outstanding Lead Actor in a Comedy Series - Jim Parsons, Outstanding Multi-Camera Picture Editing for a Comedy Series - The Cooper Extraction, Outstanding Lead Actor in a Comedy Series - Jim Parsons, Outstanding Multi-Camera Picture Editing for a Comedy Series - The Comic Book Store Regeneration, Outstanding Multi-Camera Picture Editing for a Comedy Series - The Opening Night Excitation and Outstanding Multi-Camera Picture Editing for a Comedy Series - The Holiday Summation.moreless",
    "network" : "CBS"
  },
  "http://www.tv.com/shows/days-of-our-lives/" : {
    "premiere_date" : "",
    "title" : "Days of our Lives",
    "storyline" : "Like sands through the hourglass, so are the Days of our Lives... For over forty years, those words, spoken by the late Macdonald Carey, have introduced and underscored one of daytime drama's rare mainstays. NBC's Days of our Lives, will celebrate its 52nd anniversary on November 8, 2017. It first premiered as a half-hour drama in 1965 and expanded to an hour ten years later. Today, it remains a consistent favorite among viewers of daytime television serials. It is the powerhouse of NBC's soap opera lineup and demonstrates its staying power in television history. In its lifetime years, Days of our Lives has garnered numerous Emmy Awards, Soap Opera Digest Awards and People's Choice Awards. The show's success derives from its consistent commitment to excellence in writing and storytelling, supported by an ensemble of performers, and an uncanny knack for anticipating viewer interests. From demonic possessions and baby switches to exciting teen stories and love triangles, Days of our Lives remains a perennial favorite among viewers of all ages. Filmed in Burbank, California, Days of our Lives is set in the fictitious midwestern town of Salem. The core families are the Hortons and the Bradys, and the multi-layered storylines involve elements of romance, adventure, mystery, comedy and drama. Original cast member Frances Reid continues to star as Alice Horton. Days of our Lives is produced by Corday Productions Inc. in association with Sony Pictures Television. Executive producer, Ken Corday, is following in the tradition of his parents, Betty and Ted Corday, who co-created Days of our Lives and helmed the series for many years.moreless",
    "network" : "NBC"
  },
  "https://www.tvguide.com/tvshows/3/874982/" : {
    "premiere_date" : "November 25, 2016",
    "title" : "3%",
    "storyline" : "A futuristic thriller of a world divided into two domains, one of destruction and one of progress, and only 3% of those that try to transition to the better side are able to succeed.",
    "network" : ""
  },
  "https://www.metacritic.com/tv/the-good-wife" : {
    "premiere_date" : "Sep 22, 2009",
    "title" : "The Good Wife",
    "storyline" : "Alicia (Julianna Margulies) returns to her previous career as a lawyer after a scandal brings down her politician husband (Chris Noth).",
    "network" : "CBS"
  },
  "https://trakt.tv/shows/the-big-bang-theory" : {
    "premiere_date" : "2007-09-24",
    "title" : "The Big Bang Theory",
    "storyline" : "A woman who moves into an apartment across the hall from two brilliant but socially awkward physicists shows them how little they know about life outside of the laboratory.",
    "network" : "CBS"
  },
  "https://www.themoviedb.org/tv/10545-true-blood?language=en-US" : {
    "premiere_date" : "2008",
    "title" : "True Blood",
    "storyline" : "True Blood is an American television drama series created and produced by Alan Ball. It is based on The Southern Vampire Mysteries series of novels by Charlaine Harris, detailing the co-existence of vampires and humans in Bon Temps, a fictional, small town in northwestern Louisiana. The series centers on the adventures of Sookie Stackhouse, a telepathic waitress with an otherworldly quality.",
    "network" : "HBO"
  },
  "https://www.rottentomatoes.com/tv/scrubs" : {
    "premiere_date" : "Oct 2, 2001",
    "title" : "Scrubs",
    "storyline" : "An engaging (and periodically serious) look at hospital work through the eyes of a young intern, coping with unusual challenges presented by colleagues as well as patients. The show is a smart mix of humor and social commentary, and has had a diverse lineup of guest stars, including Colin Hay of Men at Work, Brendan Fraser, Dick Van Dyke and, in one of his rare TV appearances since he left full-time work because of Parkinson's disease, Michael J. Fox.",
    "network" : "ABC"
  },
  "https://www.imdb.com/title/tt2085059/?ref_=nv_sr_1" : {
    "premiere_date" : "4 December 2011",
    "title" : "Black Mirror",
    "storyline" : "Set in a world only minutes from our own, \"Black Mirror\" unveils how modern technologies can backfire and be used against their makers, every episode set in a slightly different reality with different characters combating different types of technologies.",
    "network" : ""
  },
  "https://www.themoviedb.org/tv/1434-family-guy?language=en-US" : {
    "premiere_date" : "1999",
    "title" : "Family Guy",
    "storyline" : "Sick, twisted, politically incorrect and Freakin' Sweet animated series featuring the adventures of the dysfunctional Griffin family. Bumbling Peter and long-suffering Lois have three kids. Stewie (a brilliant but sadistic baby bent on killing his mother and taking over the world), Meg (the oldest, and is the most unpopular girl in town) and Chris (the middle kid, he's not very bright but has a passion for movies). The final member of the family is Brian - a talking dog and much more than a pet, he keeps Stewie in check whilst sipping Martinis and sorting through his own life issues.",
    "network" : "FOX"
  },
  "https://www.imdb.com/title/tt2372162/?ref_=nv_sr_1" : {
    "premiere_date" : "11 July 2013",
    "title" : "Orange Is the New Black",
    "storyline" : "Convicted of a decade old crime of transporting drug money to an ex-girlfriend, normally law-abiding Piper Chapman is sentenced to a year and a half behind bars to face the reality of how life-changing prison can really be.",
    "network" : ""
  },
  "https://www.themoviedb.org/tv/1100-how-i-met-your-mother?language=en-US" : {
    "premiere_date" : "2005",
    "title" : "How I Met Your Mother",
    "storyline" : "How I Met Your Mother is an American sitcom that originally aired on CBS from September 19, 2005, to March 31, 2014. The series follows the main character, Ted Mosby, and his group of friends in Manhattan. As a framing device, Ted, in the year 2030, recounts to his son and daughter the events that led to his meeting their mother.",
    "network" : "CBS"
  },
  "https://www.imdb.com/title/tt3655448/?ref_=nv_sr_1" : {
    "premiere_date" : "15 January 2017",
    "title" : "The Young Pope",
    "storyline" : "Young and charming, newly elected Pius XIII, aka Lenny Belardo, is the first American Pope in history. His ascension appears to be the result of a simple, effective media strategy implemented by the College of Cardinals. In the Vatican, however, the prevailing wisdom is the church's leaders have chosen a mysterious figure as their guiding force. And Pius XIII proves to be the most mysterious and contradictory of them all. As Belardo begins his reign, he is stubbornly resistant to the Vatican stewards, instead relying on Sister Mary to serve as his chief adviser. While she urges him to focus on leading his billion followers, the young pope shows little interest in making himself known, either to the College of Cardinals or to the masses. The 10-episode drama series stars Jude Law in the title role and Diane Keaton as Sister Mary, a nun from the U.S. now living in Vatican City.",
    "network" : ""
  },
  "https://www.imdb.com/title/tt0362359/?ref_=nv_sr_1" : {
    "premiere_date" : "5 August 2003",
    "title" : "The O.C.",
    "storyline" : "Ensemble drama revolving around the young adult community of the Orange County, California, area. A street-smart teen winds up in the midst of the high-class society of Newport Beach, sparking something of an \"edgier\" take on the \"Melrose Place\" style premise.",
    "network" : ""
  },
  "https://www.themoviedb.org/tv/61664-sense8?language=en-US" : {
    "premiere_date" : "2015",
    "title" : "Sense8",
    "storyline" : "One gunshot, one death, one moment out of time that irrevocably links eight minds in disparate parts of the world, putting them in each other's lives, each other's secrets, and in terrible danger. Ordinary people suddenly reborn as \"Sensates.\"",
    "network" : "Netflix"
  },
  "https://www.rottentomatoes.com/tv/flash" : {
    "premiere_date" : "Oct 7, 2014",
    "title" : "The Flash",
    "storyline" : "Scientist Barry Allen acquires super speed through a freak accident and becomes known as the Fastest Man Alive in this adaptation of the DC Comics character the Flash.",
    "network" : "CW"
  },
  "https://www.imdb.com/title/tt0273855/?ref_=nv_sr_2" : {
    "premiere_date" : "28 March 2001",
    "title" : "My Wife and Kids",
    "storyline" : "Damon Wayans plays Michael Kyle, a man on a tragically funny quest for a \"traditional\" family. He's a not-so-modern man living in a very modern world. Can you relate? His stay-at-home bride (Tisha Campbell-Martin) became a stock market trailblazer. His only son idolizes gangster rap stars instead of him. His moody, adolescent daughter's two favorite hobbies are asking him for money and giving him grief. And his youngest daughter rarely lets her daddy have the last word. Perhaps after all of the chaos is over, he will realize that his dream of having a normal American family came true a long time ago.",
    "network" : ""
  },
  "https://www.imdb.com/title/tt0108778/?ref_=nv_sr_1" : {
    "premiere_date" : "22 September 1994",
    "title" : "Friends",
    "storyline" : "Rachel Green, Ross Geller, Monica Geller, Joey Tribbiani, Chandler Bing and Phoebe Buffay are six 20 something year-olds, living off of one another in the heart of New York City. Over the course of ten years, this average group of buddies goes through massive mayhem, family trouble, past and future romances, fights, laughs, tears and surprises as they learn what it really means to be a friend.",
    "network" : ""
  },
  "http://www.tv.com/shows/supernatural/" : {
    "premiere_date" : "",
    "title" : "Supernatural",
    "storyline" : "Supernatural features stars Jensen Ackles and Jared Padalecki as Dean and Sam Winchester, two brothers who travel the country looking for their missing father and battling evil spirits along the way. Sam Winchester is a college student bound for law school, determined to escape his family's past - unlike his older brother, Dean. Ever since they were little their father has been consumed with an obsession to find the evil forces that murdered his beloved wife, in result recruiting and training his two young sons to help him in revenge. They have grown up as hunters of the supernatural. Sam escaped under the premise of going to college, and now has a happy life with his girlfriend, Jessica, and a promising future career. Dean, however, stayed behind with his father to join him in his \"hunting\". Dean goes to Sam for help when their father goes missing. Now Sam must join his brother to find him. His one weekend trip to search for the missing John Winchester becomes an ongoing quest after a horrible tragedy ruins any thought of a happy life for Sam. The two brothers, bound by tragedy and blood to their mission, travel across the country encountering terrifying and dangerous forces most believe to be nothing but superstition and folklore, such as the Lady in White, the Indian beast known as the Wendigo, Phantom Travelers who cause plane crashes, Bloody Mary, vampires, demons and many more.moreless",
    "network" : "The CW"
  },
  "https://www.imdb.com/title/tt5420376/?ref_=nv_sr_1" : {
    "premiere_date" : "26 January 2017",
    "title" : "Riverdale",
    "storyline" : "After the death of one of the rich and popular Blossom twins on the 4th of July, the small town of Riverdale investigates the murder. The series starts in September, the beginning of a new school year, that brings with it new students, relationships, and reveals the mysteries of the past 4th of July.",
    "network" : ""
  },
  "https://trakt.tv/shows/desperate-housewives" : {
    "premiere_date" : "2004-10-04",
    "title" : "Desperate Housewives",
    "storyline" : "In the town of Fairview there's a street called Wisteria Lane; a peaceful cul-de-sac with manicured lawns and beautiful houses. It's a place where you know all your neighbors and your neighbors know all about you. It's the perfect suburban fantasy. But, behind every picket fence there are secrets. And, in every seemingly happy home, you'll find jealousy, lust, passion, and sometimes... murder.",
    "network" : "ABC"
  },
  "https://www.rottentomatoes.com/tv/game_of_thrones?" : {
    "premiere_date" : "Apr 17, 2011",
    "title" : "Game of Thrones",
    "storyline" : "An adaptation of author George R.R. Martin's \"A Song of Ice and Fire\" medieval fantasies about power struggles among the Seven Kingdoms of Westeros.",
    "network" : "HBO"
  },
  "https://www.rottentomatoes.com/tv/mr_robot" : {
    "premiere_date" : "May 27, 2015",
    "title" : "Mr. Robot",
    "storyline" : "Mr. Robot follows Elliot Alderson, a young computer programmer with an anxiety disorder, who is recruited by Mr Robot and his anarchist team of hackers 'fsociety'.",
    "network" : "USA"
  },
  "https://www.tvguide.com/tvshows/gossip-girl/288136/" : {
    "premiere_date" : "September 19, 2007",
    "title" : "Gossip Girl",
    "storyline" : "Privileged students in Manhattan keep up on local gossip from a secretive blogger who gets the scoop on everything and everyone. Based on the series of books by Cecily von Ziegesar.",
    "network" : ""
  }
}